class c: #colors

    endc = '\033[0m' # обычный 
    red = '\033[31m' # красный
    orange = '\033[91m' # оранжевый
    green = '\033[32m' # зеленый
    lgreen = '\033[92m' # светло-зеленый
    yellow = '\033[33m' # желтый
    lyellow = '\033[93m' # светло-желтый
    blue = '\033[34m' # синий
    lblue = '\033[94m' # светло-синий
    violet = '\033[35m' # фиолетовый
    lviolet = '\033[95m' # светло-фиолетовый
    turquoise = '\033[36m' #бирюзовый
    lturquoise = '\033[96m' # светло-бирюзовый
    grey = '\033[90m' # серый
    lgrey = '\033[37m' # светло-серый

class b: #background

    red = '\033[41m' # красный
    orange = '\033[101m' # оранжевый
    green = '\033[42m' # зеленый
    lgreen = '\033[102m' # светло-зеленый
    yellow = '\033[43m' # желтый
    lyellow = '\033[103m' # светло-желтый
    blue = '\033[44m' # синий
    lblue = '\033[104m' # светло-синий
    violet = '\033[45m' # фиолетовый
    lviolet = '\033[105m' # светло-фиолетовый
    turquoise = '\033[46m' # бирюзовый
    lturquoise = '\033[106m' # светло-бирюзовый
    grey = '\033[100m' # серый
    lgrey = '\033[47m' # светло-серый
    white = '\033[7m' # белый на черном

class s: #style

    updash = '\033[53m' # черта сверху
    downdash = '\033[4m' # черта снизу
    downdashtwo = '\033[21m' # две черты снизу
    italics = '\033[3m' # курсив
    bold = '\033[1m' # жирный
    blink = '\033[5m' # мигающий
    dash = '\033[9m' # зачеркнутый